from dataclasses import dataclass

@dataclass
class CommonTexts:
    welcome : str = "🏢 Укажите НКО либо продолжите без указания:"
    your_nko: str = "🏢 Ваша НКО:"
    input_name_and_descryption: str = "✏️ Напишите название, описание, формы деятельности, принципы, место работы и прочие важные данные о вашей НКО:"
    choose_style: str = "🎨 Выберите стиль:"
    input_your_idea: str = "💡 Введите свою идею для поста:"
    which_type_of_event: str = "📅 Введите что за событие, дата, место, кто приглашён, дополнительные детали:"
    example_of_post_and_improvements: str = "📝 Введите пример поста который следует изменить, а также данные для изменения:"
    choose_form: str = "✏️ Выбреите форму текста:"
    which_ideas: str = "🤔 Какие идеи вы хотите получить? Идеи визуала? Или может быть что другое?"
    generating_text: str = "⏳ Пишу текст, пожалуйста подождите..."
    saved_succesfully: str = "✅ Успешно сохранено!"
    your_posts: str = "📰 Ваши посты"
    text_descryption_for_picture: str = "🎨 Введите текстовое описание картинки для рисования:"
    wait_picture_generating: str = "⏳ Рисую изображение, пожалуйста подождите..."
    your_picture: str = "✅ Ваше нарисованное изображение:"
    generate_another_picture: str = "❓ Нарисовать еще одно фото?"
    text_descryption_for_plan: str = "📅 Введите текстовое описание контент плана для создания:"
    what_we_will_edit: str = "✏️ Выберите что вы хотите изменить:"
    input_post_for_improvement: str = "📝 Введите исходный текст поста и изменения которые вы хотите применить. Например: исправить ошибки, добавить смайлики, предложения по улучшению поста:"

texts = CommonTexts()